design_model/src/main/resources/行为型模式/备忘录模式/备忘录模式.md
```mermaid
classDiagram
    class Memento {
        <<备忘录>>
        -state;
        +getState();
        +setState();
    }
    class Caretaker {
        <<负责人>>
    }
    class Originator {
        <<原发器>>
        -state;
        +restoreMemento(Memento m);
        +createMemento();
    }
    note for Originator "state=m.getState();\nreturn new Memento(state)" 
    Caretaker o-- Memento
    Originator ..> Memento
```
